const flowersData = {
  agapanthus: {
    id: "agapanthus",
    title: "Агапантус",
    description:
      "Агапантус — род многолетних травянистых растений семейства Агапантовые, его название происходит от греч. αγαπη — «любовь» и ανθος — «цветок».",
    video: "../assets/video/1.mp4",
    backgroundImage: "../assets/images/flowers/1.jpg",
    img: "../assets/images/search/1.jpg",
    name: {
      scientific: "Agapanthus",
      common: "Африканская лилия, Нильская лилия",
    },
    care: {
      cultiv: "Средний",
      watering: "каждые 3-7дн",
      light: "Частичное Полное",
    },
    info: {
      type: "Многолетнее травянистое",
      size: "60 см-1,5 м",
      period: "Лето-Ранняя осень",
      colors: "Синий, фиолетовый, белый",
      area: "Южная Африка",
    },
    accordion: {
      image: "../assets/images/flowers/картинка-заглушка.jpg",
      light:
        "Агапантус обожает солнце и лучше всего цветет на открытых, хорошо освещенных участках. Хотя он может переносить легкую полутень, для обильного цветения ему требуется не менее 6-8 часов прямого солнечного света в день.",
      watering:
        "В период активного роста и цветения агапантус нуждается в умеренном и регулярном поливе. После укоренения он становится засухоустойчивым, но длительные периоды засухи могут негативно сказаться на цветении, поэтому важно избегать как пересыхания, так и застоя воды.",
      soil: "Агапантус предпочитает хорошо дренированную, плодородную почву, но довольно терпим к различным типам грунта. Главное условие – отличный дренаж, чтобы избежать заболачивания, которое может привести к загниванию корней.",
      cultiv:
        "Агапантус легко выращивается как в открытом грунте, так и в контейнерах, и часто размножается делением корневища весной или после цветения. Он хорошо переносит легкую корневую стесненность в горшках, что даже может стимулировать более обильное цветение.",
      fertilizer:
        "Хотя агапантус не требует обильных подкормок, весной перед началом роста и в середине лета можно внести сбалансированное удобрение. Слишком много азота может стимулировать рост листвы в ущерб цветению, поэтому лучше использовать удобрения с повышенным содержанием фосфора и калия для стимуляции бутонов.",
      pest: "Агапантус отличается хорошей устойчивостью к большинству вредителей и болезней. Изредка могут беспокоить слизни и улитки, а также корневая гниль при чрезмерном поливе или плохом дренаже.",
      varieties:
        "Существуют как вечнозеленые, так и листопадные виды агапантуса, предлагающие широкий спектр форм и размеров. Цветки обычно встречаются в оттенках синего и фиолетового, но также есть красивые белые сорта, а размеры варьируются от компактных миниатюрных до высоких, эффектных экземпляров.",
    },
  },

  alstroemeria: {
    id: "alstroemeria",
    title: "Альстромерия",
    description:
      "Альстромерия — многолетнее травянистое растение родом из Южной Америки. Известна также как «перуанская лилия» или «лилия инков» из-за схожести с лилией.",
    video: "../assets/video/2.mp4",
    backgroundImage: "../assets/images/flowers/2.jpg",
	img: "../assets/images/search/2.jpg",
    name: {
      scientific: "Alstroemeria",
      common: "Перуанская лилия, Лилия инков",
    },
    care: {
      cultiv: "Средний",
      watering: "каждые 3-7дн",
      light: "Частичное Полное",
    },
    info: {
      type: "Многолетнее",
      size: "80–200 см",
      period: "Лето",
      colors: "Розовый, фиолетовый, красный, желтый, оранжевый, белый",
      area: "Южная Америка",
    },
    accordion: {
      image: "../assets/images/flowers/картинка-заглушка.jpg",
      light:
        "Альстромерия предпочитает яркий, но рассеянный свет. В жарком климате ей необходима полутень в полуденные часы, а в более прохладных регионах она может переносить утреннее солнце.",
      watering:
        "Требует умеренного и регулярного полива, особенно в период активного роста и цветения. Важно дать верхнему слою почвы подсохнуть между поливами, чтобы избежать застоя воды и корневой гнили",
      soil: "Идеальной для альстромерии является плодородная, хорошо дренированная и рыхлая почва. Она предпочитает слабокислый или нейтральный pH, поэтому добавление компоста или песка улучшит структуру и дренаж.",
      cultiv:
        "Размножается преимущественно делением корневищ или клубней, что обеспечивает более быстрое цветение по сравнению с выращиванием из семян. Для успешного роста важно обеспечить прохладные ночи, так как это стимулирует формирование бутонов.",
      fertilizer:
        "В период активного роста и цветения растение нуждается в регулярных, но умеренных подкормках. Используйте сбалансированное жидкое удобрение или удобрение с повышенным содержанием калия для стимуляции обильного цветения.",
      pest: "Альстромерия относительно устойчива, но может поражаться тлей, паутинным клещом и слизнями. Из болезней чаще всего встречается корневая гниль при избыточном поливе и плохом дренаже, а также пятнистость листьев.",
      varieties:
        "Существует огромное разнообразие сортов альстромерии, от компактных карликовых форм до высоких срезочных видов. Они отличаются широким спектром окрасок, узоров и размеров цветков, включая гибриды с необычными сочетаниями оттенков.",
    },
  },

  amaryllis: {
    id: "amaryllis",
    title: "Амариллис",
    description:
      "Амариллис — луковичное растение рода «Hippeastrum» и переводится с греческого как «рыцарская звезда», что прекрасно описывает величественные, звездообразные цветы этого растения.",
    video: "../assets/video/3.mp4",
    backgroundImage: "../assets/images/flowers/3.jpg",
	img: "../assets/images/search/3.jpg",
    name: {
      scientific: "Amaryllis",
      common: "Лилия белладонна, Джерсийская лилия",
    },
    care: {
      cultiv: "Средний",
      watering: "каждые 3-7дн",
      light: "Частичное Полное",
    },
    info: {
      type: "Луковичный многолетник",
      size: "30-75 см",
      period: "Зима-Начало весны",
      colors: "Разнообразный",
      area: "Южная Америка",
    },
    accordion: {
      image: "../assets/images/flowers/картинка-заглушка.jpg",
      light:
        "Амариллис требует яркого, но рассеянного света; хорошо подходит восточное или южное окно с защитой от прямых полуденных лучей. Для обильного цветения обеспечьте не менее 6-8 часов качественного освещения в день.",
      watering:
        "Во время активного роста и цветения поливайте умеренно, давая верхнему слою почвы просохнуть между поливами, чтобы избежать загнивания луковицы. В период покоя полив значительно сокращают или полностью прекращают.",
      soil: "Для амариллиса необходим легкий, плодородный и хорошо дренированный субстрат, чтобы предотвратить застой влаги. Отлично подходит смесь из листовой земли, торфа, песка и небольшого количества перегноя.",
      cultiv:
        "Луковицу амариллиса сажают в горшок так, чтобы примерно одна треть или половина ее оставалась над поверхностью почвы. Для повторного цветения важно обеспечить луковице период покоя после отцветания и увядания листьев.",
      fertilizer:
        "Подкармливайте амариллис комплексными минеральными удобрениями для луковичных растений каждые 2-4 недели в период активного роста и цветения. Прекратите подкормки, когда листья начинают увядать, готовя растение к периоду покоя.",
      pest: "Амариллис может быть подвержен нападению мучнистых червецов, паутинных клещей и щитовок, а также поражаться грибковыми заболеваниями, такими как красная гниль (стагоноспороз) или фузариоз. Регулярный осмотр и своевременное удаление пораженных частей помогут предотвратить распространение проблем.",
      varieties:
        "Существует огромное количество сортов амариллиса с разнообразными формами цветков – от простых до махровых, игольчатых или бахромчатых. Цветовая палитра включает белый, розовый, красный, оранжевый, зеленый, а также двухцветные и полосатые варианты.",
    },
  },

  astilbe: {
    id: "astilbe",
    title: "Астильба",
    description:
      "Астильба — многолетнее травянистое растение, известное своими пышными, перисто-метельчатыми соцветиями, которые создают эффект воздушности и легкости расцветая в разнообразных оттенках от белого до ярко-розового, красного и лилового.",
    video: "../assets/video/4.mp4",
    backgroundImage: "../assets/images/flowers/4.jpg",
	img: "../assets/images/search/4.jpg",
    name: {
      scientific: "Astilbe",
      common: "Ложная спирея",
    },
    care: {
      cultiv: "Легкий",
      watering: "каждую неделю",
      light: "Частичное Полутень",
    },
    info: {
      type: "Многолетнее травянистое корневищное",
      size: "15-20 см | 100-120 см",
      period: "Лето-Ранняя осень",
      colors: "Белый, розовый, красный, сиреневый, пурпурный",
      area: "Восточная Азия, Северная Америка",
    },
    accordion: {
      image: "../assets/images/flowers/картинка-заглушка.jpg",
      light:
        "Астильба идеально чувствует себя в полутени или полной тени, где она защищена от прямых полуденных солнечных лучей. На ярком солнце листья могут обгорать, а цветение – сокращаться, если почва не остается постоянно влажной.",
      watering:
        "Астильба очень влаголюбива и требует регулярного и обильного полива, особенно в жаркую и сухую погоду. Не допускайте пересыхания почвы, так как это может привести к увяданию листьев и ухудшению цветения.",
      soil: "Предпочитает плодородные, рыхлые, богатые гумусом почвы с хорошим дренажем и слабокислой или нейтральной реакцией. Убедитесь, что почва хорошо удерживает влагу, но при этом не застаивается.",
      cultiv:
        "Астильба легко выращивается в открытом грунте как многолетник; ее корневища высаживают весной или осенью, заглубляя почки на 3-5 см. Раз в 4-5 лет рекомендуется делить и пересаживать кусты для омоложения.",
      fertilizer:
        "В период активного роста и перед цветением астильбу полезно подкармливать комплексными минеральными удобрениями или органикой, такой как компост или перегной. После цветения можно внести фосфорно-калийные удобрения для укрепления корневой системы.",
      pest: "Астильба довольно устойчива к вредителям и болезням, но иногда может страдать от пенницы слюнявой, галловой нематоды или вирусных заболеваний. Правильный уход и поддержание оптимальной влажности почвы помогут предотвратить большинство проблем.",
      varieties:
        "Существует множество видов и гибридных сортов астильбы, отличающихся по высоте (от карликовых до гигантских), форме соцветий (метельчатые, пирамидальные, поникающие) и окраске цветков. Цветовая гамма включает белый, розовый, красный, сиреневый и пурпурный, а также различные оттенки листвы.",
    },
  },

  astrantia: {
    id: "astrantia",
    title: "Астранция",
    description:
      "странция — многолетнее травянистое растение, известна благодаря своим уникальным соцветиям, напоминающим крошечные «звезды» или «подушечки для булавок».",
    video: "../assets/video/5.mp4",
    backgroundImage: "../assets/images/flowers/5.jpg",
	img: "../assets/images/search/5.jpg",
    name: {
      scientific: "Astrantia",
      common: "Звездовка",
    },
    care: {
      cultiv: "Легкий",
      watering: "каждые 2-3дн",
      light: "Частичное",
    },
    info: {
      type: "Многолетнее травянистое корневищное",
      size: "40-90 см",
      period: "Лето",
      colors: "Белый, розовый, красный, зеленоватый, фиолетовый",
      area: "Центральная и Восточная Европа, Западная Азия",
    },
    accordion: {
      image: "../assets/images/flowers/картинка-заглушка.jpg",
      light:
        "Астранция лучше всего растет в полутени, где утреннее солнце сменяется послеполуденной тенью, или в ажурной тени деревьев. На полном солнце она будет хорошо себя чувствовать только при условии постоянно влажной почвы, в противном случае цветение может быть менее пышным.",
      watering:
        "Астранция предпочитает постоянно влажную почву, поэтому требуется регулярный и умеренный полив, особенно в засушливые периоды. Важно избегать как пересыхания, так и застоя воды, чтобы предотвратить гниение корней.",
      soil: "Идеальная почва для астранции – это плодородная, богатая гумусом, хорошо дренированная, слабокислая или нейтральная. Перед посадкой рекомендуется улучшить почву компостом или перегноем.",
      cultiv:
        "Астранция – неприхотливый многолетник, который легко выращивать в открытом грунте. Она образует компактные кусты и хорошо размножается делением корневищ весной или осенью, а также может давать самосев.",
      fertilizer:
        "Подкармливать астранцию можно раз в год весной, внося компост или комплексное минеральное удобрение. Дополнительные подкормки во время цветения могут стимулировать более обильное и продолжительное цветение.",
      pest: "Астранция отличается высокой устойчивостью к вредителям и болезням, что делает ее очень желанным растением для «ленивого» сада. Изредка могут появиться тля или улитки, но серьезные проблемы встречаются редко.",
      varieties:
        "Существует несколько видов и множество сортов астранции, таких как «Astrantia major» (большая), «Astrantia maxima» (крупнейшая) и их гибриды, предлагающие разнообразие оттенков прицветников. Цветы могут быть белыми, розовыми, красными, винными или зеленоватыми, часто с контрастными кончиками прицветников, что придает им изысканный вид.",
    },
  },

  aster: {
    id: "aster",
    title: "Астра",
    description:
      " Астры — обширный род многолетних травянистых растений семейства Астровые (Asteraceae), название «Aster» происходит от древнегреческого слова ἀστήρ, что означает «звезда».",
    video: "../assets/video/6.mp4",
    backgroundImage: "../assets/images/flowers/6.jpg",
	img: "../assets/images/search/6.jpg",
    name: {
      scientific: "Aster",
      common: "Звездчатый цветок",
    },
    care: {
      cultiv: "Легкий",
      watering: "каждые 2-7дн",
      light: "Частичное Полное",
    },
    info: {
      type: "Многолетнее травянистое",
      size: "15-20 см | 150-200 см",
      period: "Конец лета-Осень",
      colors: "Белый, розовый, красный, синий, фиолетовый",
      area: "Северная Америка",
    },
    accordion: {
      image: "../assets/images/flowers/картинка-заглушка.jpg",
      light:
        "Астры, как многолетние, так и однолетние, являются солнцелюбивыми растениями и требуют полного солнца для обильного цветения, что составляет не менее 6-8 часов прямого света в день. В легкой полутени они тоже могут расти, но цветение будет менее пышным.",
      watering:
        "Астры предпочитают умеренный, но регулярный полив, особенно в засушливые периоды, чтобы почва оставалась равномерно влажной. Избегайте переувлажнения, которое может привести к корневым гнилям, особенно у многолетних видов.",
      soil: "Для астр подходит плодородная, рыхлая, хорошо дренированная почва с нейтральной или слабощелочной реакцией. Тяжелые глинистые почвы следует улучшать песком и компостом для лучшего дренажа.",
      cultiv:
        "Однолетние астры обычно выращивают из семян, высевая их на рассаду или прямо в грунт, а многолетние размножают делением куста весной или осенью. Обе группы легко приживаются и быстро развиваются.",
      fertilizer:
        "В течение вегетационного периода астры хорошо отзываются на подкормки комплексными минеральными удобрениями: весной – с преобладанием азота, а перед цветением – с повышенным содержанием фосфора и калия. Своевременные подкормки обеспечивают пышное и продолжительное цветение.",
      pest: "Астры могут поражаться мучнистой росой (особенно многолетние астры в условиях повышенной влажности), фузариозом и вертициллезным увяданием. Из вредителей встречаются тля, паутинный клещ и слизни. Регулярная профилактика и правильный уход минимизируют риски.",
      varieties:
        "Астры поражают своим разнообразием: существуют тысячи сортов однолетней астры с цветками от простых до пионовидных и игольчатых, и многочисленные многолетние виды (например, новоанглийская, новобельгийская, альпийская астры), отличающиеся высотой и сроками цветения. Цветовая палитра охватывает почти весь спектр, кроме ярко-желтого (он чаще встречается в серединке).",
    },
  },

  berzelia: {
    id: "berzelia",
    title: "Берцелия",
    description:
      "Берцелия (Бруния) — это кустарниковое растение, родом из Южной Африки, а именно из уникальной растительной зоны Финбос, известной своим эндемичным биоразнообразием.",
    video: "../assets/video/7.mp4",
    backgroundImage: "../assets/images/flowers/7.jpg",
	img: "../assets/images/search/7.jpg",
    name: {
      scientific: "Berzelia",
      common: "Бруния",
    },
    care: {
      cultiv: "Сложный",
      watering: "каждые 5-10дн",
      light: "Полное",
    },
    info: {
      type: "Вечнозеленый кустарник",
      size: "1-3 м",
      period: "Зима-Весна",
      colors: "Зеленый, белый, коричнеый, серый",
      area: "Южная Африка",
    },
    accordion: {
      image: "../assets/images/flowers/картинка-заглушка.jpg",
      light:
        "Берцелия требует полного солнца для полноценного роста и развития, ей необходимо как минимум 6-8 часов прямого солнечного света ежедневно. В условиях недостаточного освещения растение будет чахнуть и не сможет сформировать характерные декоративные «шарики».",
      watering:
        "Полив должен быть умеренным и строго после просыхания верхних 5-7 см почвы, так как берцелия крайне чувствительна к переувлажнению и застою воды. В природных условиях она приспособлена к сухим периодам, поэтому избыточная влага для нее губительна.",
      soil: "Для успешного выращивания берцелии критически важна очень хорошо дренированная, бедная, песчаная или каменистая почва с кислой реакцией, имитирующая ее естественную среду обитания в финбосе. Тяжелые, глинистые или слишком плодородные почвы абсолютно неприемлемы.",
      cultiv:
        "Выращивание берцелии в открытом грунте возможно только в очень мягких субтропических или средиземноморских климатических зонах, в остальных случаях требуется оранжерея со строгим контролем условий. Размножение чаще всего происходит семенами, требующими скарификации и стратификации, или черенками.",
      fertilizer:
        "Берцелия не нуждается в обильных подкормках и даже может пострадать от избытка питательных веществ, особенно фосфора, к которому она очень чувствительна. Если подкормка необходима, используйте очень слабые растворы удобрений, разработанных для протеев или других растений финбоса.",
      pest: "При правильных условиях выращивания Берцелия довольно устойчива к вредителям и болезням, однако неправильный полив (особенно переувлажнение) может привести к корневым гнилям. Редкие вредители, такие как мучнистые червецы, могут появиться в условиях оранжереи.",
      varieties:
        "В роду «Brunia» насчитывается около 7 видов, но во флористике наиболее часто встречаются «Brunia albiflora» и «Brunia laevis» и их межвидовые формы, которые ценятся за свои характерные зеленые, серебристые или коричневатые шаровидные «головки». Существуют также формы с более крупными или мелкими «шариками».",
    },
  },
};
